app/Controllers/Dashboard.php

SELECT *
FROM `guru`
---
    public function admin_dash()
    {
        $data = [
            'murid' => $this->muridModel->findAll(),
            'guru' => $this->guruModel->findAll(),
            'mapel' => $this->mapelModel->findAll()
        ];

SELECT *
FROM `murid`
WHERE `murid`.`id` = '3'
---
    public function murid_dash()
    {
        $getMurid =  $this->muridModel->find($this->session->get('id'));

SELECT *
FROM `guru`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `guru`
---
    public function guru_view()
    {
        $currPage = $this->request->getVar('page_guru') ?  $this->request->getVar('page_guru') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $db = $this->guruModel->search($keyword);
        } else {
            $db =  $this->guruModel;
        }
        $data = [
            'guru' => $db->paginate(5, 'guru'),
            'pager' => $this->guruModel->pager,
            'currPage' => $currPage
        ];

SELECT *
FROM `murid`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `murid`
---
    public function murid_view()
    {
        $currPage = $this->request->getVar('page_murid') ?  $this->request->getVar('page_murid') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $db = $this->muridModel->search($keyword);
        } else {
            $db =  $this->muridModel;
        }
        $data = [
            'murid' => $db->paginate(5, 'murid'),
            'pager' => $this->muridModel->pager,
            'currPage' => $currPage
        ];

SELECT *
FROM `murid`
WHERE `murid`.`id` = '5'
---
    public function murid_edit($id)
    {
        $data = [
            'murid' => $this->muridModel->find($id),
        ];

SELECT *
FROM `murid`
WHERE `murid`.`id` = '1'
UPDATE `murid` SET `no_induk` = 'AB43221', `nama` = 'Gareth Bale', `tgl_lahir` = '1998-07-22', `jenis` = 'p', `kelas` = '1'
WHERE `murid`.`id` IN ('1')
---
    public function murid_update_profile($id)
    {
        $data = $this->muridModel->find($id);
        $validate = $this->validate([
            'no_induk' => $data['no_induk'] ==  $this->request->getPost('no_induk') ? 'required' : 'is_unique[murid.no_induk]|required',
            'tgl_lahir' => 'required',
            'nama' => 'required',
            'jenis' => 'required',
            'kelas' => 'required',

        ]);
        if (!$validate) {
            session()->setFlashdata('gagal', 'Cek Form Kembali');
            return redirect()->to('/murids/profile');
        }
        $this->muridModel->save([
            "id" => $id,
            "no_induk" => $this->request->getPost('no_induk'),
            "nama" => $this->request->getPost('nama'),
            "tgl_lahir" => $this->request->getPost('tgl_lahir'),
            "jenis" =>  $this->request->getPost('jenis'),
            "kelas" =>  $this->request->getPost('kelas')
        ]);