app/Controllers/Dashboard.php

DELETE FROM `murid`
WHERE `id` IN ('1')
---
    public function murid_delete($id)
    {
        $this->muridModel->delete($id);