app/Controllers/LoginApp.php

    public function store_login()
    {
        $data = $this->request->getPost();
        $user = $this->userModel->where('username', $data['username'])->first();

        if ($user) {
            if ($user['password'] != md5($data['password'])) {
                session()->setFlashdata('password', 'Password salah');
                return redirect()->to('/');
            } else {
                if ($user['role'] == 'admin') {
                    $nama_user =  $this->guruModel->where('id', $user['guru_id'])->first();
                } else {
                    $nama_user =  $this->muridModel->where('id', $user['murid_id'])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'james'
 LIMIT 1
SELECT *
FROM `murid`
WHERE `id` = '3'
 LIMIT 1