app/Models/DetailMuridModel.php

    public function getSudahNilai($id)
    {
        $query = $this->db->table('detail_murid');
        $query->select('nilai,murid.nama as nama_murid');
        $query->join('murid', 'murid.id = detail_murid.murid_id');
        $query->where('detail_murid.mapel_id', $id);
        return $query->get()->getResult();
---
SELECT `detail_murid`.`id`, `nilai`, `murid`.`nama` as `nama_murid`
FROM `detail_murid`
JOIN `murid` ON `murid`.`id` = `detail_murid`.`murid_id`
WHERE `detail_murid`.`mapel_id` = '4'