app/Models/MapelModel.php

SELECT `mata_pelajaran`.`kode` as `kode_mapel`, `mata_pelajaran`.`nama` as `nama_mapel`, `detail_murid`.`nilai`
FROM `mata_pelajaran`
LEFT JOIN `detail_murid` ON `mata_pelajaran`.`id` = `detail_murid`.`mapel_id`
WHERE `mata_pelajaran`.`kelas` = '2'
AND `detail_murid`.`murid_id` = '3'
---
    public function getSudahNilai($id_siswa, $kelas)
    {
        $query = $this->db->table('mata_pelajaran');
        $query->select('mata_pelajaran.kode as kode_mapel,mata_pelajaran.nama as nama_mapel,detail_murid.nilai');
        $query->join('detail_murid', 'mata_pelajaran.id = detail_murid.mapel_id', 'left');
        $query->where('mata_pelajaran.kelas', $kelas);
        $query->where('detail_murid.murid_id', $id_siswa);
        return $query->get()->getResult();

SELECT `mata_pelajaran`.`id`, `mata_pelajaran`.`kode` as `kode_mapel`, `mata_pelajaran`.`nama` as `nama_mapel`, `guru`.`nama` as `nama_guru`, `mata_pelajaran`.`kelas`
FROM `mata_pelajaran`
LEFT JOIN `guru` ON `mata_pelajaran`.`id` = `guru`.`mata_pelajaran_id`
---
    public function getMapelGuru()
    {
        $query = $this->db->table('mata_pelajaran');
        $query->select('mata_pelajaran.id, mata_pelajaran.kode as kode_mapel,mata_pelajaran.nama as nama_mapel , guru.nama as nama_guru , mata_pelajaran.kelas ');
        $query->join('guru', 'mata_pelajaran.id = guru.mata_pelajaran_id', 'left');
        return $query->get()->getResult();