app/Models/MuridModel.php

SELECT `nama`, `id`
FROM `murid`
WHERE `kelas` = '1'
---
    public function getBelumNilai($id)
    {
        $query = $this->db->table('murid');
        $query->select('nama,id');
        $query->where('kelas', $id);
        return $query->get()->getResult();